# Space_RenAssignZoneX

## Description
Rename existing Zone (x) from a space object.

```pascal
PROCEDURE Space_RenAssignZoneX(
				space    : HANDLE;
				index    : INTEGER;
				zoneType : STRING;
				zoneName : STRING);
```

```python

def vs.Space_RenAssignZoneX(space, index, zoneType, zoneName):
    return None
```

## Parameters
|Name|Type|Description|
|---|---|---|
|space|HANDLE||
|index|INTEGER||
|zoneType|STRING||
|zoneName|STRING||

## Version
Availability: from Vectorworks 2014
## Category
* SpaceObjectCoreTools